"""
피보나치 수열
1, 1, 2, 3, 5, 8, 13, 21...

f(1) = f(2) = 1 이고
점화식은 f(n) = f(n-1) + f(n-2)
"""

# 일반적 재귀함수 형태의 피보나치수열 함수, 매우 많은 재귀호출로 시간초과.
def fib(x):
    if x == 1 or x == 2:
        return 1
    return fib(x - 2) + fib(x - 1)

print(fib(4)) # 3

# 메모이제이션 - 재귀(탑 다운)
d = [0] * 101

def fib(x):
    if x <= 1:
        d[x] = x
        return d[x]

    if d[x]:
        return d[x]

    d[x] = fib(x - 1) + fib(x - 2)
    return d[x]

fib(100)

print(d) # [0, 1, 1, 2, 3, 5, 8, 13, 21, 34 ...  218922995834555169026, 354224848179261915075]


# 타뷸레이션 - 반복(바텀 업)
d = [0] * 101

def fib(x):
    d[0], d[1] = 0, 1

    for i in range(2, x + 1):
        d[i] = d[i - 2] + d[i - 1]

    return d[x]

fib(100)

print(d) # [0, 1, 1, 2, 3, 5, 8, 13, 21, 34 ...  218922995834555169026, 354224848179261915075]