"""
피보나치 수열
1, 1, 2, 3, 5, 8, 13, 21...

f(1) = f(2) = 1 이고
점화식은 f(n) = f(n-1) + f(n-2)
"""

# 일반적 재귀함수 형태의 피보나치수열 함수, 매우 많은 재귀호출로 시간초과.
def fibo(x):
    if x == 1 or x == 2:
        return 1
    return fibo(x - 2) + fibo(x - 1)

print(fibo(4)) # 3

# 메모이제이션 - 재귀(탑 다운)
d = [0] * 100

def fibo(x):
    if x == 1 or x == 2:
        d[x] = 1
        return d[x]
    if d[x] != 0:
        return d[x]
    d[x] = fibo(x - 2) + fibo(x - 1)
    return d[x]

fibo(99)

print(d) # [0, 1, 1, 2, 3, 5, 8, 13, 21 ... 135301852344706746049, 218922995834555169026]


# 메모이제이션 - 반복(바텀 업)
d = [0] * 100

def fibo(x):
    d[1], d[2] = 1, 1
    for i in range(3, 100):
        d[i] = d[i - 2] + d[i - 1]

fibo(99)

print(d) # [0, 1, 1, 2, 3, 5, 8, 13, 21 ... 135301852344706746049, 218922995834555169026]